local fontpath = ""
if RegisterMod == nil then
  RegisterMod = function(modname, apiversion)
    local mod = {
      Name = modname,
      AddCallback = function(self, callbackId, fn, entityId)
        if entityId == nil then entityId = -1; end

        Isaac.AddCallback(self, callbackId, fn, entityId)
      end,
      RemoveCallback = function(self, callbackId, fn)
        Isaac.RemoveCallback(self, callbackId, fn)
      end,
      SaveData = function(self, data)
        Isaac.SaveModData(self, data)
      end,
      LoadData = function(self)
        return Isaac.LoadModData(self)
      end,
      HasData = function(self)
        return Isaac.HasModData(self)
      end,
      RemoveData = function(self)
        Isaac.RemoveModData(self)
      end
    }
    Isaac.RegisterMod(mod, modname, apiversion)
    return mod
  end
  fontpath = "scripts/resources/font/"
else
  fontpath = "font/"
end
if StartDebug == nil then
  StartDebug = function()
    local ok, m = pcall(require, "mobdebug") 
    if ok and m then
      m.start()
    else
      Isaac.DebugString("Failed to start debugging.")
      -- m is now the error 
      -- Isaac.DebugString(m)
    end
  end
end
local EID = RegisterMod( "EID Chinese Edition" ,1 );
local filepath = ""
--[[
EID features four tables for mods to define their descriptions:
__eidTrinketDescriptions for trinkets
__eidCardDescriptions for cards
__eidPillDescriptions for pills
__eidItemDescriptions for Collectibles / items
__eidItemTransformations assigns transformationinformations to collectibles

For example: to add the item "My Item Name" and the Description "Most Fitting Description" do something like this:

-- 1. Get your itemid
local item = Isaac.GetItemIdByName("My Item Name");
-- 2. Make sure we're not adding to a nil table
if not __eidItemDescriptions then
  __eidItemDescriptions = {};
end
-- 3. Add the description
__eidItemDescriptions[item] = "Most Fitting Description";

--]]

local config = {

-- Change Width of the info boxes. (In characters)
-- Default = 18
  ["TextboxWidth"]="18",
-- Change Size of the info boxes. Range: [0,...,1]
-- Default = 0.75
  ["Scale"]="0.75",
-- Set transparency of the background. Range: [0,...,1]
-- Default = 0.75
  ["Transparency"]="0.75",
  -- Set X Position (Width) of the descriptiontext
  -- Default = 70
  ["XPosition"]="70",
  -- Set Y Position (Height) of the descriptiontext
  -- Default = 30
  ["YPosition"]="30",
  -- Display informations when the floor has curse of the blind ( ? - Items)
  -- Default = false
  ["EnableOnCurse"]="false",
  -- Set the distance to an item in which informations will be displayed (in Tiles)
  -- Default = 4
  ["MaxDistance"]="4",
  -- Toggle Display of Transformation icons
  -- Default = true
  ["TransformationIcons"]="true",
  -- Toggle Display of Transformation text
  -- Default = true
  ["TransformationText"]="true",
  -- Toggle Display of Card / Rune descriptions
  -- Default = true
  ["DisplayCardInfo"]="true",
  -- Toggle Display of Card / Rune descriptions when its a shop item
  -- Default = false
  ["DisplayCardInfoShop"]="false",
  -- Error message displayed when an error occurs
  -- Default = [物品未找到]
  ["ErrorMessage"]="[物品未找到]",
  -- Toggle Display of Pill descriptions
  -- Default = true
  ["DisplayPillInfo"]="true",
  ["DisplayPillInfoShop"]="true",
  ["UnidentifiedPillMessage"]="— 未知胶囊",
  ["ShowUnidentifiedPillDescriptions"]= "false",
  -- 设置文字行高
  -- Default = 15
  ["FontLineHeigh"] = 15,
  -- 设置文字单行长度
  -- Default = 230
  ["FontMaxLength"] = 230,
  -- 设置字体大小，建议范围：10~25
  -- Default = 13
  ["FontSize"] = 13,
  -- 设置字体透明度，范围在0~1之间
  -- Default = 0.62
  ["FontTransparency"] = 0.62,
  -- 设置字体缩放
  -- Default = 1
  ["FontScale"] = 1,
  -- 设置字符表加载方式：0-仅动态加载，1-预先加载需要的字符表，2-预先加载完整字符表
  -- Default = 2
  ["FontLoadMode"] = 2
}
local fontsizeReal = config["FontSize"]
if fontsizeReal < 18 then
  fontsizeReal = 15
else
  fontsizeReal = 20
end
local fontScaleReal = config["FontSize"] / fontsizeReal * config["FontScale"]
local fontmap = require("fontmap_"..fontsizeReal)
local kernings = require("kernings_"..fontsizeReal)
local spritetable = {}
local defaultpages={
  [15]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,277,278},
  [20]={0,1,2,3,4,5,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,60,61,62,63,64,65,66,67,68,69,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,147,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,278,279,280,281,282,283,284,285,287,289}
}

--可以以中文形式来修改道具效果，换行以\n代替。
local descriptarray = {
  [1]={"伤心洋葱\n·射速上升。","0"},
  [2]={"内眼\n·角色每次发射3颗眼泪。","0"},
  [3]={"弯勺者\n·角色的眼泪获得追踪效果。","0"},
  [4]={"克里吉特的头\n·眼泪变大，击退效果上升，伤害上升。","0"},
  [5]={"我的镜像\n·角色的眼泪会飞回角色身边。","0"},
  [6]={"小号\n·射程大幅下降，射速大幅上升。","0"},
  [7]={"殉道者之血\n·伤害上升。","0"},
  [8]={"波比弟弟\n·发射普通眼泪的跟班。","4"},
  [9]={"粪臭素\n·苍蝇不再攻击角色。","3"},
  [10]={"苍蝇光环\n·两个阻挡敌人眼泪的苍蝇环绕物。","3"},
  [11]={"1up！\n·生命+1","2"},
  [12]={"魔法菇\n·除射速和幸运外全属性上升。","2"},
  [13]={"病毒\n·碰到角色的敌人会中毒。","5"},
  [14]={"狂暴针\n·移速上升，射程上升。","5"},
  [15]={"心脏\n·心之容器+1，回满红心。","0"},
  [16]={"生肝\n·心之容器+2，回满红心。","0"},
  [17]={"骷髅钥匙\n·钥匙+99","0"},
  [18]={"一美元\n·硬币+99","0"},
  [19]={"砰！\n·炸弹+10","0"},
  [20]={"超凡升天\n·角色获得飞行效果。","0"},
  [21]={"指南针\n·显示特殊房间的位置。","0"},
  [22]={"午餐\n·心之容器+1","0"},
  [23]={"晚餐\n·心之容器+1","0"},
  [24]={"甜点\n·心之容器+1","0"},
  [25]={"早餐\n·心之容器+1","0"},
  [26]={"烂肉\n·心之容器+1","0"},
  [27]={"木勺\n·移速上升。","0"},
  [28]={"皮带\n·移速上升。","0"},
  [29]={"妈妈的内裤\n·射程上升。","6"},
  [30]={"妈妈的高跟鞋\n·射程上升。","6"},
  [31]={"妈妈的口红\n·射程上升。","6"},
  [32]={"铁丝衣架\n·射速上升。","0"},
  [33]={"圣经\n·使用后，获得飞行效果。","12"},
  [34]={"彼列之书\n·使用后，在当前房间内伤害上升。","12"},
  [35]={"死灵书\n·使用后，对所有敌人造成伤害。","12"},
  [36]={"大便\n·使用后，生成一个大便。","7"},
  [37]={"炸弹先生\n·使用后，放置一个大炸弹。","0"},
  [38]={"塔米猫的头\n·使用后，发射十颗眼泪。","0"},
  [39]={"妈妈的胸罩\n·使用后，房间中的所有敌人石化。","6"},
  [40]={"神风特攻队\n·使用后，角色会爆炸，对附近的敌人造成伤害。","0"},
  [41]={"妈妈的卫生巾\n·使用后，当前房间中的所有敌人恐惧。","6"},
  [42]={"鲍勃的烂脑袋\n·使用后，丢出一颗炸弹。","8"},
  [43]={"暂无道具（43）","0"},
  [44]={"传送器\n·使用后，随机传送到一个房间。","0"},
  [45]={"美味的心\n·使用后，回复一颗红心。","0"},
  [46]={"幸运脚\n·幸运上升。","0"},
  [47]={"博士的遥控器\n·使用后，召唤一枚导弹。","0"},
  [48]={"丘比特之箭\n·角色的眼泪获得穿透效果。","0"},
  [49]={"嗖-哒-呜\n·使用后，发射一道激光柱。","0"},
  [50]={"史蒂文\n·伤害上升。","0"},
  [51]={"五角星\n·伤害上升。","9"},
  [52]={"婴儿博士\n·角色的眼泪变为炸弹。","0"},
  [53]={"磁力\n·角色会吸引所有基础掉落。","0"},
  [54]={"藏宝图\n·显示除隐藏房和超级隐藏房以外的所有房间的位置。","0"},
  [55]={"妈妈的眼睛\n·有概率向后额外发射眼泪。","6"},
  [56]={"柠檬事故\n·使用后，生成一摊水迹，对敌人造成伤害。","0"},
  [57]={"遥远的仰慕\n·一个距离角色很远的苍蝇环绕物。","3"},
  [58]={"影之书\n·使用后，角色获得一个护盾，短时间内无敌。","12"},
  [59]={"暂无道具（59）","0"},
  [60]={"梯子\n·允许角色跨过一格宽的深渊。","0"},
  [61]={"暂无道具（61）","0"},
  [62]={"吸血鬼的魔力\n·消灭敌人会回复红心。","0"},
  [63]={"蓄电池\n·主动道具获得额外的充能条。","0"},
  [64]={"Steam打折\n·所有物品半价。","0"},
  [65]={"无政府主义者食谱\n·使用后，生成6个即爆炸弹。","12"},
  [66]={"沙漏\n·使用后，使房间中所有敌人减速。","0"},
  [67]={"玛姬妹妹\n·发射普通眼泪的跟班。","4"},
  [68]={"科技\n·角色会发射激光。","0"},
  [69]={"巧克力奶\n·蓄力发射眼泪，蓄力越久伤害越高。","0"},
  [70]={"生长激素\n·伤害上升，移速上升。","5"},
  [71]={"迷你蘑菇\n·角色变小，移速上升，射程上升。","2"},
  [72]={"念珠\n·魂心+3，获得圣经的概率提高。","10"},
  [73]={"肉块\n·肉块环绕物，拾取多个会变强。","0"},
  [74]={"25美分\n·硬币+25","0"},
  [75]={"药学博士证书\n·能够分辨药丸，坏药丸变为好药丸。","0"},
  [76]={"X光透视\n·打开隐藏房和超级隐藏房的门。","0"},
  [77]={"我的小独角\n·使用后，角色短暂性无敌，造成接触伤害。","0"},
  [78]={"启示录\n·使用后，获得一颗魂心，角色更容易遇到天启四骑士。","12"},
  [79]={"咒印\n·魂心+1，伤害上升，移速上升。","9"},
  [80]={"契约\n·魂心+2，伤害上升，射速上升。","9"},
  [81]={"死猫\n·生命+9，心之容器变为1。","1"},
  [82]={"深渊领主\n·获得飞行效果，移速上升。","9"},
  [83]={"钉子\n·使用后，魂心+1，当前房间中伤害上升，移速下降。","9"},
  [84]={"再深入些\n·使用后，生成一个通往下一层的活板门。","0"},
  [85]={"卡牌盒\n·使用后，获得一个卡牌。","0"},
  [86]={"萌死戳的牙\n·使用后，召唤萌死戳从天而降，对敌人（？）造成伤害。","0"},
  [87]={"洛基的角\n·概率发射十字眼泪。","0"},
  [88]={"小胖\n·向敌人冲撞的跟班。","0"},
  [89]={"蜘蛛之咬\n·概率发射减速眼泪。","13"},
  [90]={"小石头\n·伤害上升，射速上升，移速下降。","0"},
  [91]={"洞窟探险头盔\n·显示周围特殊房间。","0"},
  [92]={"超级绷带\n·心之容器+1，魂心+2。","0"},
  [93]={"游戏机\n·使用后，变身吃豆人，吃掉敌人会回复红心。","0"},
  [94]={"硬币袋\n·掉落硬币的跟班。","0"},
  [95]={"机器宝宝\n·发射激光的跟班。","0"},
  [96]={"小查德\n·掉落红心的跟班。","0"},
  [97]={"罪之书\n·使用后，掉落掉落物。","12"},
  [98]={"圣髑\n·掉落魂心的跟班。","0"},
  [99]={"小吉什\n·发射减速眼泪的跟班。","0"},
  [100]={"小史蒂文\n·发射追踪眼泪的跟班。","4"},
  [101]={"光环\n·心之容器+1，伤害上升，射速上升，射程上升，移速上升。","10"},
  [102]={"妈妈的药瓶\n·使用后，获得一个药丸。","6"},
  [103]={"普通感冒\n·概率发射毒性眼泪。","0"},
  [104]={"寄生虫\n·眼泪会分裂为两颗。","0"},
  [105]={"D6\n·使用后，重置房间中的道具。","0"},
  [106]={"大爆弹先生\n·炸弹的爆炸范围变大，爆炸伤害上升。","0"},
  [107]={"锯齿剪\n·使用后，角色的身体变为跟班，头获得飞行效果。","0"},
  [108]={"圣饼\n·所有伤害变为半颗心。","0"},
  [109]={"金钱就是力量\n·硬币越多，伤害越高。","0"},
  [110]={"妈妈的隐形眼镜\n·概率发射石化眼泪。","6"},
  [111]={"豆子\n·使用后，角色放屁，让附近的敌人中毒。","0"},
  [112]={"守护天使\n·阻挡眼泪的环绕物，能让环绕物的速度变快。","10"},
  [113]={"恶魔宝宝\n·自动发射眼泪的跟班。","0"},
  [114]={"妈妈的刀\n·角色发射一把能收回的刀。","6"},
  [115]={"通灵板\n·幽灵眼泪。","0"},
  [116]={"9伏特\n·使用主动道具后自动获得1格充能。","0"},
  [117]={"死鸟\n·受伤出现自动追击敌人的跟班。","0"},
  [118]={"硫磺火\n·蓄力发射血激光柱。","9"},
  [119]={"输血袋\n·心之容器+1，红心+5，移速上升。","0"},
  [120]={"奇怪的蘑菇·小\n·伤害下降，射速上升，移速上升。","2"},
  [121]={"奇怪的蘑菇·大\n·心之容器+1（空），伤害上升，射程上升，移速下降。","2"},
  [122]={"巴比伦娼妇\n·红心不大于半颗时，伤害上升，移速上升。","0"},
  [123]={"怪物手册\n·使用后，当前房间中获得一个随机跟班。","0"},
  [124]={"死海古卷\n·随机主动道具效果。","0"},
  [125]={"波比炸弹\n·炸弹+5，炸弹获得追踪效果。","0"},
  [126]={"刀片\n·使用后，受到一颗心的伤害，当前房间中伤害上升。","0"},
  [127]={"现在就忘了我\n·使用后，重置当前层。","0"},
  [128]={"孤独一生\n·半径较大的苍蝇环绕物。","3"},
  [129]={"一桶猪油\n·心之容器+2（空），红心+0.5，移速下降。","0"},
  [130]={"小马\n·获得飞行效果，移速上升。使用后，向前冲撞。","0"},
  [131]={"炸弹袋\n·掉落炸弹的跟班。","0"},
  [132]={"煤块\n·眼泪飞行越远，伤害越高。","0"},
  [133]={"嗝屁猫的爪子\n·使用后，心之容器-1，魂心+3。","1"},
  [134]={"嗝屁猫的尾巴\n·掉落箱子的概率上升。","1"},
  [135]={"献血袋\n·使用后，受到半颗红心的伤害，掉落一些硬币。","0"},
  [136]={"最好的朋友\n·使用后，放置一个吸引敌人的人偶，几秒后爆炸。","0"},
  [137]={"遥控起爆器\n·炸弹+5。使用后，引爆放置的炸弹。","0"},
  [138]={"圣伤\n·心之容器+1，伤害上升。","0"},
  [139]={"妈妈的手提包\n·可以携带两个饰品。","6"},
  [140]={"鲍勃的诅咒\n·炸弹+5，炸弹会让敌人中毒。","8"},
  [141]={"盛装男孩\n·硬币+7。","0"},
  [142]={"肩衣\n·受伤后如果只有半颗心，则魂心+1。","0"},
  [143]={"速度针\n·移速上升，弹速上升。","5"},
  [144]={"乞丐朋友\n·将硬币转换为其他掉落物的跟班。","11"},
  [145]={"嗝屁猫的头\n·使用后，生成蓝苍蝇。","1"},
  [146]={"祈祷卡\n·使用后，永恒之心+1。","0"},
  [147]={"铁镐\n·使用后，在当前房间中，角色可以摧毁障碍物。","0"},
  [148]={"害虫横行\n·受到伤害时，生成蓝苍蝇。","3"},
  [149]={"吐根\n·抛射爆炸眼泪。","8"},
  [150]={"严厉的爱\n·概率发射牙齿，造成大量伤害。","0"},
  [151]={"加击\n·击中敌人时，有概率生成蓝苍蝇。","3"},
  [152]={"科技2\n·持续发射激光。","0"},
  [153]={"突变蜘蛛\n·同时发射4颗眼泪。","13"},
  [154]={"化学蜕变\n·左眼的眼泪伤害上升。","0"},
  [155]={"窥视者\n·对角线移动的跟班。","0"},
  [156]={"修女服\n·受伤时获得1格充能。","0"},
  [157]={"嗜血\n·受到伤害时，当前层伤害上升。","0"},
  [158]={"水晶球\n·使用后，显示本层除隐藏房和超级隐藏房的地图，随机掉落卡牌或魂心。","0"},
  [159]={"夜之魂\n·获得飞行效果和幽灵眼泪。","9"},
  [160]={"裂天\n·使用后，召唤圣光攻击敌人。","0"},
  [161]={"重生十字架\n·死亡后复活变为？？？。","0"},
  [162]={"凯尔特十字架\n·受伤后有概率获得护盾。","0"},
  [163]={"幽灵宝宝\n·发射幽灵眼泪的跟班。","0"},
  [164]={"蓝蜡烛\n·使用后，发射一个火堆，一段时间后消失。","0"},
  [165]={"九尾鞭\n·伤害上升，弹速上升。","0"},
  [166]={"D20\n·使用后，重置当前房间中的掉落物。","0"},
  [167]={"丑角宝宝\n·发射分叉眼泪的跟班。","4"},
  [168]={"史诗婴儿\n·角色控制光标，召唤导弹轰击指定地点。","0"},
  [169]={"独眼巨人\n·发射巨大的眼泪。","0"},
  [170]={"长腿蜘蛛\n·自动踩踏敌人的跟班。","0"},
  [171]={"蜘蛛屁股\n·使用后，对房间中的所有敌人造成少量伤害，并使它们减速。","13"},
  [172]={"献祭匕首\n·高伤害的环绕物。","0"},
  [173]={"主教冠\n·红心变为魂心概率上升。","10"},
  [174]={"彩虹宝宝\n·发射随机特效眼泪的跟班。","0"},
  [175]={"爸爸的钥匙\n·使用后，打开所有的门。","0"},
  [176]={"干细胞\n·心之容器+1，弹速上升。","0"},
  [177]={"便携式赌博机\n·使用后，花费1枚硬币进行赌博。","0"},
  [178]={"圣水\n·受伤后留下水迹的跟班。","0"},
  [179]={"宿命\n·永恒之心+1，获得飞行效果。","0"},
  [180]={"黑豆\n·受伤时会放毒屁。","0"},
  [181]={"白马\n·获得飞行效果，移速上升。使用后，向前冲锋，召唤圣光。","0"},
  [182]={"圣心\n·获得追踪效果，心之容器+1，回满红心，伤害上升，射程上升，射速下降，弹速下降。","0"},
  [183]={"牙签\n·射速上升，弹速上升。","0"},
  [184]={"圣杯\n·心之容器+1，获得飞行效果。","10"},
  [185]={"死鸽\n·获得飞行效果和幽灵眼泪。","10"},
  [186]={"血之权力\n·使用后，受到1颗心的伤害，对房间中的所有敌人造成大量伤害。","0"},
  [187]={"嗝屁猫的毛球\n·用惯性甩动的跟班。","1"},
  [188]={"亚伯\n·位置相反的跟班。","0"},
  [189]={"超级食肉男孩脑残粉\n·心之容器+1，回复所有红心，伤害上升，射速上升，移速上升，射程上升。","0"},
  [190]={"烟火盛宴\n·炸弹+99","0"},
  [191]={"3美元\n·随机眼泪特效。","0"},
  [192]={"傻瓜心灵感应教程\n·使用后，当前房间中获得追踪效果。","12"},
  [193]={"肉！\n·心之容器+1，伤害上升。","0"},
  [194]={"8号球\n·卡牌+1，弹速上升。","0"},
  [195]={"妈妈的零钱包\n·药丸+4。","6"},
  [196]={"压榨物\n·魂心+2，射速上升。","0"},
  [197]={"耶稣果汁\n·伤害上升，射程上升。","0"},
  [198]={"盒子\n·心+1，硬币+1，炸弹+1，钥匙+1，卡牌+1，药丸+1，饰品+1。","0"},
  [199]={"妈妈的钥匙\n·钥匙+2，箱子开出的东西增多。","6"},
  [200]={"妈妈的眼影\n·概率发射魅惑眼泪。","6"},
  [201]={"铁块\n·概率发射眩晕眼泪，伤害上升。","0"},
  [202]={"点金术\n·碰到角色的敌人被金化。","0"},
  [203]={"捆绑包\n·掉落物双倍。","0"},
  [204]={"挎包\n·受伤时概率掉落随机掉落物。","0"},
  [205]={"插头\n·无充能时可以用两颗红心来充满主动道具。","0"},
  [206]={"断头台\n·头变为环绕物，伤害上升，射速上升。","0"},
  [207]={"绷带球\n·阻挡眼泪的环绕物，拾取多个会变强。","0"},
  [208]={"冠军腰带\n·精英敌人增加，伤害上升。","0"},
  [209]={"大便炸弹\n·炸弹爆炸后会使所有敌人混乱。","7"},
  [210]={"狸猫树叶\n·连续1秒不操作则会无敌。","0"},
  [211]={"蜘蛛宝宝\n·受伤时生成蓝蜘蛛。","13"},
  [212]={"嗝屁猫的项圈\n·死亡后50%概率复活。","1"},
  [213]={"遗失的隐形眼镜\n·眼泪可以阻挡敌人的眼泪，弹速下降。","0"},
  [214]={"贫血\n·受到伤害时会留下血迹，射程上升。","0"},
  [215]={"山羊头\n·必定开启恶魔房。","0"},
  [216]={"仪式法袍\n·黑心+3，伤害上升。","0"},
  [217]={"妈妈的假发\n·红心+1，发射眼泪时会生成蓝蜘蛛。","6"},
  [218]={"胎盘\n·心之容器+1，红心会随时间缓慢增加。","0"},
  [219]={"旧绷带\n·心之容器+1（空），受伤时有概率掉落红心。","0"},
  [220]={"伤心炸弹\n·炸弹+5，炸弹爆炸后，向外发射10颗眼泪。","0"},
  [221]={"橡胶胶水\n·眼泪会弹跳。","0"},
  [222]={"反重力\n·眼泪会悬停一会儿再发射，射速上升。","0"},
  [223]={"纵火狂\n·炸弹+5，受到爆炸伤害改为回复红心。","0"},
  [224]={"克里吉特的身体\n·眼泪击中物体时会分裂成4颗，射程下降，射速上升。","0"},
  [225]={"瘸子\n·受伤时有概率掉落魂心，敌人死亡时有概率掉落红心。","0"},
  [226]={"黑莲花\n·心之容器+1，魂心+1，黑心+1。","0"},
  [227]={"小猪存钱罐\n·硬币+3，受伤时会掉落硬币。","0"},
  [228]={"妈妈的香水\n·概率发射恐惧眼泪。","6"},
  [229]={"萌死戳的肺\n·蓄力抛射大量眼泪。","0"},
  [230]={"亚巴顿\n·心之容器-12，黑心+6，概率发射恐惧眼泪，伤害上升，移速上升。","9"},
  [231]={"沥青球\n·概率发射减速眼泪，角色会留下减速的沥青。","0"},
  [232]={"秒表\n·受伤后减速所有敌人，移速上升。","0"},
  [233]={"小小星球\n·眼泪会环绕角色，射程上升。","0"},
  [234]={"害虫横行2\n·角色消灭敌人时会生成蓝蜘蛛。","0"},
  [235]={"暂无道具（235）","0"},
  [236]={"大肠杆菌\n·碰到角色的怪物会变为大便。","7"},
  [237]={"死之触\n·获得穿透效果，伤害上升，射速下降。","0"},
  [238]={"钥匙碎片1\n·收集两个钥匙碎片可以挑战超级撒旦，天使房转换率上升。","0"},
  [239]={"钥匙碎片2\n·收集两个钥匙碎片可以挑战超级撒旦，天使房转换率上升。","0"},
  [240]={"试验性疗法\n·属性随机上升下降。","5"},
  [241]={"地狱契约\n·清理房间会掉落双倍的掉落物。","0"},
  [242]={"臭名昭著\n·角色有概率抵挡敌人的眼泪。","0"},
  [243]={"三位一体盾\n·抵挡眼泪的盾牌。","0"},
  [244]={"科技.5\n·额外发射随机特效激光。","0"},
  [245]={"20/20\n·同时发射2颗眼泪。","0"},
  [246]={"蓝地图\n·显示隐藏房和超级隐藏房。","0"},
  [247]={"永远的好朋友！\n·跟班变得更强。","0"},
  [248]={"虫群之心\n·蓝苍蝇和蓝蜘蛛变得更强。","3"},
  [249]={"选择\n·首领房道具二选一。","0"},
  [250]={"炸弹买一送一\n·掉落的炸弹变为双倍。","0"},
  [251]={"新手卡组\n·卡牌+1，可以携带两个卡牌，药丸变为卡牌。","0"},
  [252]={"药丸袋\n·卡牌转换为药丸，能够携带两个药丸。","0"},
  [253]={"魔法疤痕\n·心之容器+1，幸运上升。","0"},
  [254]={"血块\n·左眼眼泪伤害上升，射程上升。","0"},
  [255]={"螺丝钉\n·射速上升，弹速上升。","0"},
  [256]={"燃烧炸弹\n·炸弹+5，炸弹爆炸后会留下火焰。","0"},
  [257]={"火之意志\n·发射燃烧眼泪，点燃敌人并概率爆炸。","0"},
  [258]={"编号丢失\n·每层会重置角色的道具。","0"},
  [259]={"暗物质\n·概率发射恐惧眼泪，伤害上升。","0"},
  [260]={"黑蜡烛\n·黑心+1，解除所有诅咒。","0"},
  [261]={"眼球突出\n·眼泪的伤害会慢慢变小，伤害上升。","0"},
  [262]={"遗失书页2\n·黑心+1，受伤时如果只有一颗心，则对所有敌人造成伤害。","0"},
  [263]={"暂无道具（263）","0"},
  [264]={"聪明蝇\n·阻挡眼泪的环绕物，受伤后会自动追踪敌人。","3"},
  [265]={"干宝宝\n·阻挡眼泪的跟班，阻挡眼泪时概率对所有敌人造成伤害。","0"},
  [266]={"潮湿的袋子\n·分泌黏液并生成蓝蜘蛛的跟班。","0"},
  [267]={"机器宝宝2.0\n·用射击键控制的自动发射激光的跟班。","0"},
  [268]={"腐烂宝宝\n·生成蓝苍蝇的跟班。","4"},
  [269]={"无头宝宝\n·流血的跟班。","4"},
  [270]={"水蛭\n·自动追踪敌人的跟班，消灭敌人会回复红心。","0"},
  [271]={"神秘袋子\n·掉落随机掉落物的跟班。","0"},
  [272]={"美丽蝇\n·在房间中弹跳的会爆炸的跟班。","3"},
  [273]={"鲍勃的脑子\n·射击键发射的会爆炸的跟班。","8"},
  [274]={"基友蝇\n·受伤时生成环绕角色的苍蝇。","3"},
  [275]={"小硫磺火\n·蓄力发射血激光柱的跟班。","0"},
  [276]={"以撒的心脏\n·代替角色受伤的跟班。","0"},
  [277]={"小幽灵\n·使敌人恐惧的跟班。","0"},
  [278]={"黑暗乞丐\n·将红心转换为魂心的跟班。","11"},
  [279]={"大风扇\n·阻挡眼泪的跟班。","3"},
  [280]={"长腿茜茜\n·生成蓝蜘蛛的跟班。","0"},
  [281]={"出气筒\n·吸引敌人仇恨的跟班。","0"},
  [282]={"如何跳跃\n·使用后，向前跳跃。","12"},
  [283]={"D100\n·使用后，重置角色的所有道具，重置房间中的所有道具和掉落物。","0"},
  [284]={"D4\n·使用后，重置角色的所有道具。","0"},
  [285]={"D10\n·使用后，重置所有敌人。","0"},
  [286]={"白卡\n·使用后，触发当前卡牌的效果。","0"},
  [287]={"神秘之书\n·使用后，显示1/3的地图。","12"},
  [288]={"蜘蛛盒\n·使用后，生成蓝蜘蛛。","13"},
  [289]={"红蜡烛\n·使用后，发射一个火堆。","0"},
  [290]={"空罐子\n·可以储存红心。使用后，将储存的红心倒出。","0"},
  [291]={"冲洗！\n·使用后，将所有敌人变成大便。","7"},
  [292]={"撒旦圣经\n·使用后，黑心+1。","12"},
  [293]={"坎卜斯的头\n·使用后，发射十字血激光柱。","0"},
  [294]={"棉豆\n·使用后，角色会放屁。","0"},
  [295]={"魔法手指\n·使用后，硬币-1，对所有敌人造成伤害。","0"},
  [296]={"转换器\n·使用后，魂心-2，心之容器+1。","0"},
  [297]={"潘多拉的盒子\n·使用后，根据当前层数获得不同的效果。","0"},
  [298]={"独角兽的断角\n·使用后，短时间无敌。","0"},
  [299]={"金牛座\n·进入房间时移速会慢慢上升，到最大值时会无敌，移速下降。","0"},
  [300]={"白羊座\n·角色具有冲撞伤害，移速上升。","0"},
  [301]={"巨蟹座\n·魂心+3，受伤后当前房间中的伤害变为半颗心。","0"},
  [302]={"狮子座\n·能够摧毁障碍物。","0"},
  [303]={"处女座\n·受伤后概率获得护盾，坏药丸变为好药丸。","0"},
  [304]={"天秤座\n·硬币+6，炸弹+6，钥匙+6，平衡所有属性。","0"},
  [305]={"天蝎座\n·发射毒性眼泪。","0"},
  [306]={"射手座\n·获得穿透效果，移速上升。","0"},
  [307]={"摩羯座\n·心之容器+1，硬币+1，炸弹+1，钥匙+1，伤害上升，移速上升，射程上升，射速上升。","0"},
  [308]={"水瓶座\n·角色移动会留下水迹。","0"},
  [309]={"双鱼座\n·眼泪击退效果上升，射速上升。","0"},
  [310]={"夏娃的睫毛膏\n·伤害大幅上升，射速大幅下降，弹速下降。","0"},
  [311]={"犹大之影\n·死亡后变为黑犹大。","0"},
  [312]={"玛姬的蝴蝶结\n·心之容器+1，红心治疗量翻倍。","0"},
  [313]={"神圣斗篷\n·每个房间抵挡一次伤害。","10"},
  [314]={"雷霆大腿\n·心之容器+1，可以摧毁障碍物，移速下降。","0"},
  [315]={"奇异吸子\n·眼泪会吸引敌人和掉落物。","0"},
  [316]={"诅咒之眼\n·蓄力发射最多4颗眼泪。","0"},
  [317]={"神秘液体\n·眼泪落地或击中时生成水迹。","0"},
  [318]={"双子座\n·自动追踪敌人的连体婴儿跟班。","0"},
  [319]={"该隐的另一只眼睛\n·漂浮着的发射眼泪的跟班。","0"},
  [320]={"？？？唯一的朋友\n·射击键控制的跟班。","3"},
  [321]={"参孙的脚镣\n·可以摧毁障碍物并阻挡眼泪的跟班。","0"},
  [322]={"蒙戈宝宝\n·发射其他跟班眼泪的跟班。","4"},
  [323]={"以撒的眼泪\n·使用后，发射8向眼泪。","0"},
  [324]={"未定义\n·使用后，传送到宝箱房、隐藏房、超级隐藏房或错误房。","0"},
  [325]={"剪刀\n·使用后，将头留在原地变为跟班。","0"},
  [326]={"生命的气息\n·使用后，当充能为0时获得无敌，但每过一会儿会受到伤害。","0"},
  [327]={"全家福\n·受伤后如果只有半颗红心，则获得护盾。","0"},
  [328]={"底片\n·受伤后如果只有半颗红心·则对所有敌人造成伤害。","0"},
  [329]={"鲁多维科科技\n·用射击键控制的悬浮眼泪。","0"},
  [330]={"豆奶\n·伤害大幅下降，射速大幅上升。","0"},
  [331]={"神性\n·眼泪具有伤害光环。","0"},
  [332]={"拉撒路的破布\n·死亡后变为复活的拉撒路。","0"},
  [333]={"思想\n·显示所有地图。","0"},
  [334]={"肉体\n·心之容器+3","0"},
  [335]={"灵魂\n·魂心+2，眼泪和敌人会被角色弹开。","0"},
  [336]={"烂洋葱\n·获得穿透和幽灵效果，射程下降，弹速下降。","0"},
  [337]={"坏表\n·进入房间时，所有敌人概率减速或加速。","0"},
  [338]={"回旋镖\n·使用后，丢出回旋镖，石化敌人，并拾取掉落物。","0"},
  [339]={"安全别针\n·黑心+1，射程上升，弹速上升。","0"},
  [340]={"咖啡因药丸\n·药丸+1，体型减小，移速上升。","0"},
  [341]={"撕碎的照片\n·射速上升，弹速上升。","0"},
  [342]={"蓝蘑菇\n·心之容器+1，射速上升，弹速上升。","0"},
  [343]={"弹簧锁钥匙\n·魂心+1，钥匙+2，幸运上升。","0"},
  [344]={"纸板火柴\n·黑心+1，炸弹+3。","0"},
  [345]={"合成油\n·伤害上升，射程上升。","0"},
  [346]={"零食\n·心之容器+1","0"},
  [347]={"复视\n·使用后，复制房间中的所有物品。","0"},
  [348]={"安慰剂\n·使用后，触发当前药丸的效果。","0"},
  [349]={"木制硬币\n·使用后，概率掉落1枚硬币。","0"},
  [350]={"毒性冲击\n·每当角色进入一个有敌人的房间时，会释放毒雾，对房间中的所有敌人造成大量伤害。","0"},
  [351]={"巨豆\n·使用后，石化所有敌人，对附近的敌人造成伤害。","0"},
  [352]={"玻璃大炮\n·使用后，发射巨大眼泪，心变为半颗。","0"},
  [353]={"炸弹人\n·炸弹+5，十字炸弹。","0"},
  [354]={"琥珀玉米花\n·心之容器+1，饰品+1。","0"},
  [355]={"妈妈的珍珠项链\n·射程上升，幸运上升。","0"},
  [356]={"车载电池\n·主动道具会触发双倍效果。","0"},
  [357]={"朋友盒\n·使用后，在当前房间中复制所有跟班。","0"},
  [358]={"巫师帽\n·角色的两个眼睛同时发射眼泪， 角色的眼泪向斜45º方向飞出，眼泪可以飞跃障碍物。","0"},
  [359]={"8寸钉\n·眼泪击退效果上升，伤害上升。","0"},
  [360]={"夜魔\n·发射与角色相同眼泪的跟班。","0"},
  [361]={"命运的报偿\n·发射与角色相同眼泪特效和伤害的眼泪的跟班。","0"},
  [362]={"小宝箱\n·掉落掉落物的跟班。","0"},
  [363]={"誓约守护者\n·掉落永恒之心的环绕物。","0"},
  [364]={"朋友区\n·缓慢旋转的环绕物。","0"},
  [365]={"迷路苍蝇\n·沿墙前进的跟班。","0"},
  [366]={"分裂炸弹\n·炸弹+5，炸弹爆炸后会分裂出小炸弹。","0"},
  [367]={"黏黏炸弹\n·炸弹+5，炸弹消灭敌人会生成蓝蜘蛛。","0"},
  [368]={"溢泪\n·保持同一个方向发射眼泪会增加射速。","0"},
  [369]={"连续统\n·眼泪可以穿过墙壁从另一边射出。","0"},
  [370]={"玩偶先生\n·心+3，伤害上升，射程上升。","0"},
  [371]={"塔之诅咒\n·受伤时生成6个即爆炸弹。","0"},
  [372]={"充电宝宝\n·给予充能的跟班。","0"},
  [373]={"神枪手\n·连续命中敌人会增加伤害。","0"},
  [374]={"圣光\n·概率发射圣光眼泪。","0"},
  [375]={"寄生帽\n·免疫爆炸，概率阻挡敌人的眼泪。","0"},
  [376]={"补货\n·每当角色购买了一个物品后，刷新出一个新的物品。","0"},
  [377]={"炸裂蛛巢\n·蜘蛛不再攻击角色。","0"},
  [378]={"大号\n·按住射击键3秒会生成大便炸弹。","0"},
  [379]={"双瞳\n·眼泪变宽，更容易命中敌人。","0"},
  [380]={"买路财\n·硬币+5，用硬币代替钥匙开门。","0"},
  [381]={"伊甸的祝福\n·在你的下一局游戏开始时，随机获得一个道具。射速上升。","0"},
  [382]={"友好球\n·使用后，丢出友好球捕捉怪物或将捕捉的怪物放出。","0"},
  [383]={"眼泪起爆器\n·使用后，角色在空中的所有眼泪分裂成6颗。","0"},
  [384]={"小肉山\n·蓄力冲撞的跟班。","0"},
  [385]={"笨笨\n·拾取硬币变强的跟班。","0"},
  [386]={"D12\n·使用后，重置房间中的所有岩石。","0"},
  [387]={"香炉\n·给予角色一个圆形光环，使光环内的所有敌人与敌人的眼泪减速。","0"},
  [388]={"钥匙乞丐\n·将钥匙变为箱子的跟班。","11"},
  [389]={"符文袋\n·掉落符文的跟班。","0"},
  [390]={"炽天使\n·发射圣心眼泪的跟班。","0"},
  [391]={"背叛\n·受伤后魅惑所有敌人。","0"},
  [392]={"黄道带\n·每层获得一个十二星座的效果。","0"},
  [393]={"蛇蝎之吻\n·发射毒性眼泪，碰到角色的敌人中毒。","0"},
  [394]={"标记\n·角色控制一个光标，自动向光标处发射眼泪。","0"},
  [395]={"科技X\n·蓄力发射激光环。","0"},
  [396]={"心室手术刀\n·使用后，生成一个黄色或蓝色的传送门，角色可以在传送门间传送。","0"},
  [397]={"牵引光束\n·角色控制一道光束，角色发射的所有眼泪都会被控制在光束之中。","0"},
  [398]={"上帝果实\n·概率发射缩小眼泪，缩小的怪物可以被角色踩死。","0"},
  [399]={"虚空大嘴\n·蓄力生成血激光环围绕着角色。","0"},
  [400]={"命运之枪\n·角色控制一把长枪。","0"},
  [401]={"爆炸物\n·概率发射黏性炸弹","0"},
  [402]={"混沌\n·打乱道具池。","0"},
  [403]={"蜘蛛模组\n·显示敌人血量的跟班。","13"},
  [404]={"放屁宝宝\n·阻挡眼泪会放屁的跟班。","0"},
  [405]={"恶性漏洞\n·给敌人附加随机状态的跟班。","0"},
  [406]={"D8\n·使用后，重置属性。","0"},
  [407]={"纯粹\n·获得属性加成光环，一种属性对应一种颜色。","0"},
  [408]={"祭典之刃\n·受伤时生成血激光环。","0"},
  [409]={"空容器\n·没有红心时获得飞行效果和随机护盾。","0"},
  [410]={"邪恶之眼\n·概率发射眼睛，眼睛会和角色一起发射眼泪。","0"},
  [411]={"欲望之血\n·消灭敌人会在当前房间中增加伤害。","0"},
  [412]={"恶魔受胎\n·受伤一定次数会获得恶魔跟班。","0"},
  [413]={"圣灵受胎\n·拾取一定次数的心会获得天使跟班。","0"},
  [414]={"更多选择\n·宝箱房的道具二选一。","0"},
  [415]={"光之冠\n·魂心+2，满红心时发射钻石眼泪。","0"},
  [416]={"深口袋\n·可以携带两个卡牌或药丸。","0"},
  [417]={"魅魔\n·具有伤害加成光环的跟班。","0"},
  [418]={"水果蛋糕\n·每颗眼泪都具有随机特效。","0"},
  [419]={"传送器2.0\n·使用后，随机传送到一个未进入过的房间。","0"},
  [420]={"黑色粉末\n·角色会留下黑色粉末，粉末围成圈会形成魔法阵，对敌人造成伤害。","0"},
  [421]={"腰豆\n·使用后，魅惑附近的敌人。","0"},
  [422]={"发光的沙漏\n·使用后，将时间倒转到上一个房间。","0"},
  [423]={"保护之环\n·概率弹回追踪眼泪的光环。","0"},
  [424]={"麻袋头\n·掉落物有概率变为福袋。","0"},
  [425]={"手电筒\n·控制一个手电筒，被手电筒照射到的敌人和敌人的眼泪会减速。","0"},
  [426]={"痴迷粉丝\n·模仿角色轨迹的跟班。","0"},
  [427]={"矿工\n·使用后，放置一个可移动的TNT。","0"},
  [428]={"睡衣\n·魂心+4，回满红心。","0"},
  [429]={"店主的头\n·发射硬币眼泪，击中敌人概率掉落硬币。","0"},
  [430]={"老爹苍蝇\n·模仿角色轨迹的发射眼泪的跟班。","0"},
  [431]={"多维宝宝\n·模仿角色轨迹的复制眼泪的跟班。","0"},
  [432]={"闪光炸弹\n·炸弹+5，炸弹爆炸后概率掉落掉落物。","0"},
  [433]={"我的影子\n·受伤后会生成一只黑色的蛆为你作战。","0"},
  [434]={"苍蝇罐头\n·消灭敌人会变为蓝苍蝇储存在罐子中。使用后，将蓝苍蝇释放出来。","0"},
  [435]={"小洛基\n·发射4向眼泪的跟班。","0"},
  [436]={"牛奶！\n·受伤后，在当前房间中射速上升。","0"},
  [437]={"D7\n·使用后，重置房间，角色可以再次清理该房间。","0"},
  [438]={"奶嘴\n·魂心+1，射速上升。","0"},
  [439]={"妈妈的盒子\n·饰品效果翻倍，幸运上升。使用后，随机掉落1个饰品。","0"},
  [440]={"肾结石\n·每隔一段时间会蓄力发射肾结石。","0"},
  [441]={"超级吐息\n·使用后，喷射巨大的血激光柱，持续15秒。","0"},
  [442]={"黑暗王子的王冠\n·角色有1颗红心时，射程上升，射速上升，弹速上升。","0"},
  [443]={"苹果！\n·概率发射刀片，射速上升。","0"},
  [444]={"铅笔\n·每发射15颗眼泪，则抛射大量眼泪。","0"},
  [445]={"狗的牙齿\n·探测隐藏房、超级隐藏房和暗门，伤害上升，移速上升。","0"},
  [446]={"死牙\n·发射眼泪时会生成毒雾。","0"},
  [447]={"徘徊豆\n·发射眼泪有概率发射毒雾。","0"},
  [448]={"玻璃碎片\n·受伤时概率掉落掉落物、射程上升并留下血迹。","0"},
  [449]={"金属板\n·魂心+1，眼泪击中角色时概率弹回一个眩晕眼泪。","0"},
  [450]={"贪婪的眼睛\n·概率消耗硬币发射黄金眼泪。","0"},
  [451]={"塔罗牌外衣\n·卡牌+1，卡牌的效果翻倍。","0"},
  [452]={"静脉曲张\n·受伤时发射10颗眼泪。","0"},
  [453]={"复杂性骨折\n·发射会分裂的骨头，射程上升。","0"},
  [454]={"多指畸形\n·卡牌/药丸+1，可以携带2个卡牌/药丸。","0"},
  [455]={"爸爸丢失的硬币\n·幸运币+1，射程上升。","0"},
  [456]={"发霉的面包\n·心之容器+1","0"},
  [457]={"笨蛋\n·魂心+1，概率阻挡伤害。","0"},
  [458]={"肚脐\n·饰品+1，可以携带2个饰品。","0"},
  [459]={"鼻窦炎\n·概率发射黏在敌人身上的鼻屎。","0"},
  [460]={"青光眼\n·概率发射致盲眼泪。","0"},
  [461]={"拟寄生物\n·概率发射会生成蓝蜘蛛或蓝苍蝇的虫卵。","0"},
  [462]={"彼列之眼\n·获得穿透效果，眼泪穿透一个敌人后会获得追踪效果且伤害翻倍。","0"},
  [463]={"硫酸\n·发射硫酸眼泪，摧毁障碍物。","0"},
  [464]={"平衡标志\n·魂心+2，精英敌人会掉落角色缺少的掉落物。","0"},
  [465]={"模拟摇杆\n·角色可以沿对角线发射眼泪，射速上升。","0"},
  [466]={"传染病\n·每个房间中第一个死亡的敌人会释放毒雾，让其他敌人中毒，中毒的敌人死亡后也会释放毒雾。","0"},
  [467]={"手指！\n·发射隐形激光的跟班。","0"},
  [468]={"阴影\n·跟随角色的跟班。","0"},
  [469]={"抑郁症\n·留下水迹的跟班。","0"},
  [470]={"小Hush\n·漂浮的跟班，按射击键停止移动。","0"},
  [471]={"小萌死戳\n·蓄力抛射眼泪的跟班。","0"},
  [472]={"国王宝宝\n·聚集跟班的跟班。","0"},
  [473]={"大胖\n·缓慢冲撞的跟班。","0"},
  [474]={"扁桃体\n·获得一个扁导体跟班，跟随角色并会抵挡敌人的子弹。","0"},
  [475]={"C计划\n·使用后，消灭所有敌人，3秒后消灭角色。","0"},
  [476]={"D1\n·使用后，随机复制1个掉落物。","0"},
  [477]={"虚空\n·使用后，吞噬房间中的所有道具，被动道具变为属性加成，主动道具的效果被加入虚空。","0"},
  [478]={"暂停\n·使用后，冻结所有敌人，直到玩家按下射击键。","0"},
  [479]={"熔炉\n·使用后，将饰品变为被动道具。","0"},
  [480]={"堆肥\n·使用后，将房间中的掉落物变为蓝苍蝇或蓝蜘蛛。","0"},
  [481]={"数据矿工\n·使用后，贴图旋转，随机眼泪特效，随机属性增减。","0"},
  [482]={"遥控器\n·使用后，变换人物，失去1个道具。","0"},
  [483]={"超级妈妈！\n·使用后，打开本层所有的门，摧毁本层所有障碍物，对本层所有敌人造成大量伤害。","0"},
  [484]={"等等，什么？\n·使用后，角色放屁，并发射石刃波。","0"},
  [485]={"弯曲的硬币\n·使用后，硬币+1，概率复制房间中的所有物品，否则使它们消失。","0"},
  [486]={"钝刀片\n·使用后，触发一次受伤的效果。","0"},
  [487]={"土豆剥皮器\n·使用后，心之容器-1，获得一个肉块，伤害上升，射程上升。","0"},
  [488]={"节拍器\n·使用后，当前房间中获得随机道具效果。","0"},
  [489]={"D无限\n·随机骰子效果。使用后，变为其他骰子。","0"},
  [490]={"伊甸的灵魂\n·使用后，道具+2。","0"},
  [491]={"酸宝宝\n·掉落药丸的跟班。","0"},
  [492]={"注意听！\n·探测隐藏的东西，幸运上升。","0"},
  [493]={"肾上腺素\n·空的心之容器越多，伤害越高。","0"},
  [494]={"雅各布天梯\n·发射会生成电弧的眼泪。","0"},
  [495]={"断魂椒\n·概率发射火焰。","0"},
  [496]={"安乐死\n·概率发射针筒，消灭敌人时会发射10颗眼泪。","0"},
  [497]={"迷彩内裤\n·进入房间时，除非按下射击键，否则敌人不会攻击角色。","0"},
  [498]={"二元性\n·同时开启恶魔房和天使房。","0"},
  [499]={"圣餐\n·必定开启天使房。","0"},
  [500]={"袋中袋\n·掉落福袋的跟班。","0"},
  [501]={"贪婪的喉咙\n·硬币越多，心之容器越多。","0"},
  [502]={"大痘\n·概率发射能减速敌人的青春痘。","0"},
  [503]={"小角\n·概率发射刺骨眼泪，秒杀怪物。","0"},
  [504]={"棕色金块\n·使用后，生成会对附近的敌人发射眼泪的自机苍蝇跟班。","0"},
  [505]={"精灵宝可Go\n·进入房间时，概率生成被魅惑的敌人。","0"},
  [506]={"背刺者\n·攻击敌人的背部可以造成更高的伤害。","0"},
  [507]={"锋利的吸管\n·使用后，对房间中的所有敌人造成伤害，概率掉落半魂心。","0"},
  [508]={"妈妈的剃刀\n·造成接触伤害的环绕物。","0"},
  [509]={"血泪之眼\n·向外发射眼泪的环绕物。","0"},
  [510]={"精神错乱\n·使用后，召唤一个被魅惑的首领。","0"},
  [511]={"愤怒苍蝇\n·环绕敌人造成接触伤害的跟班。","3"},
  [512]={"黑洞\n·使用后，抛出一个吸引所有东西的黑洞。","0"},
  [513]={"派对帽\n·魂心+1，伤害上升，受伤有概率生成彩虹大便。","0"},
  [514]={"损坏的调制解调器\n·随机冻结敌人，让敌人掉线。","0"},
  [515]={"神秘礼物\n·使用后，生成一个随机道具。","0"},
  [516]={"洒水器\n·使用后，生成一台洒水器，自动向外发射眼泪，离开房间后消失。","0"},
  [517]={"快速炸弹\n·炸弹+7，角色放置炸弹的冷却时间缩短。","0"},
  [518]={"盒子里的宝宝\n·发射随机眼泪的随机跟班。","0"},
  [519]={"小精神错乱\n·随机变形的跟班。","0"},
  [520]={"跨接电缆\n·每消灭15个敌人便获得1格充能。","0"},
  [521]={"优惠券\n·使用后，使房间中的随机一个物品免费。","0"},
  [522]={"念力\n·使用后，角色周围的敌人的眼泪停止移动，持续2秒。2秒后这些眼泪被弹回。","0"},
  [523]={"搬运盒\n·使用后，将所有物品打包到盒子中；或者将盒子中的物品放出来。","0"},
  [524]={"科技零\n·角色的眼泪之间会以电弧连接，电弧会对敌人造成伤害。","0"},
  [525]={"麻风病\n·受伤后生成一个身体环绕物，阻挡眼泪并造成接触伤害。","0"},
  [526]={"七印\n·会追踪敌人并生成蓝苍蝇的跟班。","0"},
  [527]={"我先生！\n·使用后，生成一个分身，帮你拾取掉落物或炸开隐藏房。","0"},
  [528]={"天使棱镜\n·将眼泪变为4颗的环绕物。","0"},
  [529]={"噗！\n·角色会发射互相碰撞的眼球。","0"},
  [530]={"死亡名单\n·按顺序消灭怪物会获得奖励。","0"},
  [531]={"泪血症\n·眼泪弧线前进，碰到地板、敌人或障碍物时会分裂。","0"},
  [532]={"趋泪行为\n·角色的眼泪会慢慢减速，将眼泪打入另一颗眼泪可以增加眼泪的伤害。当眼泪停下、碰到障碍物或被打入累计5颗眼泪时会分裂成8颗小眼泪。","0"},
  [533]={"三圣颂\n·角色会发射可以穿透敌人的白色光束弹。","0"},
  [534]={"书包\n·角色可以同时拥有两个主动道具。","0"},
  [535]={"毛毯\n·• 魂心+1\n• 进入BOSS房间时获得护盾","0"},
  [536]={"牺牲祭坛\n·• 使用后牺牲一名跟班，获得一个恶魔道具（最多使用2次）","0"},
  [537]={"小垃圾虫\n·• 呕吐跟班，获得时掉落一个胶囊\n• 角色使用胶囊会改变跟班颜色","0"},
  [538]={"弹珠\n·• 随机掉落3个随机饰品\n• 受伤时永久获得当前的饰品效果","0"},
  [539]={"神秘的蛋\n·• 受伤时获得一只友方怪物","0"},
  [540]={"扁扁的石头\n·• 弹性眼泪，眼泪弹跳前进","0"},
  [541]={"骨髓\n·• 骨心+1\n• 掉落3颗红心","0"},
  [542]={"打滑的肋骨\n·• 获得肋骨环绕物，可以反射子弹","0"},
  [543]={"万圣节土地\n·• 每个房间第一次受伤时产生发光的白色大便，范围内射速上升","0"},
  [544]={"尖尖的肋骨\n·• 角色获得指向角色正面的骨钉，对敌人造成接触伤害","0"},
  [545]={"死亡之书\n·• 使用后，当敌人被杀死时随机产生一只友方骷髅，只在当前房间有效","0"},
  [546]={"爸爸的戒指\n·• 产生金色光环，敌方触碰会被石化","0"},
  [547]={"离婚协议书\n·• 骨心+1，射速+0.7\n• 获得时掉落一个神秘纸张饰品","0"},
  [548]={"颌骨\n·• 产生一个颌骨，可以像回旋镖一样投掷，造成2倍伤害","0"},
  [549]={"易碎的骨头\n·• 获得后失去全部红心，并获得6颗骨心","0"},
  [550]={"损坏的铲子柄\n·• 获得被动效果：周期性在角色位置造成妈腿攻击（敌我不分）\n• 使用后当前房间消除这个效果","0"},
  [551]={"损坏的铲子头\n·• 与损坏的铲子柄组成妈妈的铲子","0"},
  [552]={"妈妈的铲子\n·• 使用后打开通往下一层的门\n• 在黑暗层某房间使用可解锁Forgotten角色","0"}
}

local trinketdescriptions = {
  [1]="被吞下的硬币\n·受伤时掉落硬币。",
  [2]="石化大便\n·摧毁大便掉落物品的概率上升。",
  [3]="7号电池\n·主动道具差1格时自动充满。",
  [4]="损坏的遥控器\n·使用主动道具会随机传送。",
  [5]="紫色的心\n·精英敌人的出现概率上升。",
  [6]="损坏的磁铁\n·角色会吸引硬币。",
  [7]="念珠的珠子\n·天使房转换率上升。",
  [8]="卡带\n·受伤时概率触发无敌效果。",
  [9]="跳跳虫\n·眼泪忽大忽小。",
  [10]="扭扭虫\n·眼泪扭来扭去。",
  [11]="环形虫\n·眼泪螺旋前进。",
  [12]="扁形虫\n·眼泪缓慢前进。",
  [13]="商店券\n·免费购买一个物品。",
  [14]="老茧\n·防止角色受到的地形伤害。",
  [15]="幸运石\n·摧毁岩石会掉落硬币。",
  [16]="妈妈的脚趾甲\n·每隔一段时间会召唤妈妈的腿。",
  [17]="黑口红\n·黑心的掉落概率上升。",
  [18]="圣言册\n·永恒之心的掉落概率上升。",
  [19]="回形针\n·打开金箱子不需要钥匙。",
  [20]="猴爪\n·角色只有半颗心时，获得黑心，只能触发3次。",
  [21]="神秘纸张\n·概率触发各种纸的效果。",
  [22]="恶魔尾巴\n·所有心变为黑心。",
  [23]="寻人启事\n·死亡后变为游魂。",
  [24]="放屁硬币\n·拾取硬币时会放屁。",
  [25]="神秘糖果\n·角色会随机放屁或生成大便。",
  [26]="钩形虫\n·眼泪方形前进。",
  [27]="鞭形虫\n·眼泪快速前进。",
  [28]="损坏的十字架\n·死亡后概率复活为？？？。",
  [29]="鱼头\n·受伤时生成蓝苍蝇。",
  [30]="粉红眼睛\n·概率发射毒性眼泪。",
  [31]="图钉\n·概率发射穿透眼泪。",
  [32]="裸盖菇\n·随机获得其他蘑菇的效果。",
  [33]="脐带\n·只有半颗心时生成一个小史蒂文跟班。",
  [34]="小孩的心脏\n·红心的掉落概率上升。",
  [35]="弯角\n·伤害上升。",
  [36]="生锈的钥匙\n·钥匙和箱子的掉落概率上升。",
  [37]="羊蹄\n·移速上升。",
  [38]="妈妈的珍珠\n·魂心的掉落概率上升。",
  [39]="癌症\n·射速上升。",
  [40]="红补丁\n·受伤时当前房间中概率伤害上升。",
  [41]="火柴棒\n·炸弹的掉落概率上升。",
  [42]="幸运脚趾\n·幸运上升。",
  [43]="诅咒头骨\n·受伤后如果角色只有半颗心，则会随机传送。",
  [44]="安全盖\n·药丸的掉落概率上升。",
  [45]="黑桃A\n·卡牌的掉落概率上升。",
  [46]="以撒的叉子\n·清理房间概率回复红心。",
  [47]="暂无饰品（47）",
  [48]="遗失书页\n·受伤后概率触发全屏伤害。",
  [49]="染血硬币\n·拾取硬币概率掉落红心。",
  [50]="焦糊硬币\n·拾取硬币概率掉落炸弹。",
  [51]="扁硬币\n·拾取硬币概率掉落钥匙。",
  [52]="伪造硬币\n·拾取硬币概率获得双倍硬币。",
  [53]="血虱\n·无法被其他饰品替换，血量很高的敌人会减少血量，进入首领房后会恢复红心。",
  [54]="以撒的头\n·发射穿透眼泪的跟班。",
  [55]="玛姬的信仰\n·进入下一层时会获得永恒之心。",
  [56]="犹大的舌头\n·交易只需要一颗心之容器。",
  [57]="？？？的灵魂\n·发射幽灵追踪眼泪的跟班。",
  [58]="参孙的辫子\n·消灭敌人时在当前房间中概率获得伤害上升。",
  [59]="该隐的眼睛\n·进入下一层时概率显示特殊房间位置。",
  [60]="夏娃的鸟爪\n·受伤时概率生成死鸟跟班。",
  [61]="左手\n·箱子变为红箱子。",
  [62]="闪光的石头\n·宝箱石头每60秒闪烁一次。",
  [63]="安全剪刀\n·即爆炸弹和超级即爆炸弹变为炸弹。",
  [64]="彩虹虫\n·随机蠕虫特效。",
  [65]="胶带虫\n·眼泪飞得更远。",
  [66]="懒虫\n·眼泪飞得更慢。",
  [67]="裂开的骰子\n·受伤时概率触发一种骰子的效果。",
  [68]="超级磁铁\n·角色吸引掉落物、敌人和敌人的眼泪。",
  [69]="褪色的全家福\n·角色偶尔会变为透明色，使所有敌人混乱。",
  [70]="虱子\n·偶尔生成蓝蜘蛛。",
  [71]="鲍勃的气囊\n·炸弹会留下绿色的水迹。",
  [72]="钮扣电池\n·电池的掉落概率上升。",
  [73]="爆炸帽子\n·炸弹爆炸后有概率掉落一个炸弹。",
  [74]="暗门探测器\n·发现暗门的概率上升。",
  [75]="错误\n·每个房间会获得一个随机饰品效果。",
  [76]="筹码\n·箱子会出现更多东西或者什么都不出现。",
  [77]="水疱\n·眼泪击退效果上升。",
  [78]="二手烟\n·敌人受到异常状态的时间延长。",
  [79]="无限的难以言喻\n·使用卡牌或药丸时，有概率掉落一个相同的卡牌或药丸。",
  [80]="黑羽毛\n·邪恶的道具越多，角色的伤害越高。",
  [81]="盲目的怒火\n·角色受伤后的无敌时间增加。",
  [82]="金马掌\n·宝箱房有概率变为二选一。",
  [83]="商店钥匙\n·进入商店不需要钥匙。",
  [84]="贪婪的肋骨\n·商店中不会出现贪婪。",
  [85]="业\n·捐献给捐款机概率回复红心、生成乞丐或幸运上升。",
  [86]="幼虫\n·摧毁大便会生成蓝苍蝇。",
  [87]="妈妈的吊坠\n·使用钥匙时会回复红心。",
  [88]="不！\n·主动道具不再出现。",
  [89]="栓童绳\n·跟班会更加紧凑。",
  [90]="棕色帽子\n·摧毁大便会爆炸。",
  [91]="胎粪\n·大便有概率变为黑大便。",
  [92]="裂开的王冠\n·被动道具提供更多的属性加成。",
  [93]="用过的尿布\n·概率获得粪臭素的效果。",
  [94]="鱼尾\n·生成两倍的蓝苍蝇和蓝蜘蛛。",
  [95]="黑牙\n·概率发射黑牙。",
  [96]="衔尾虫\n·眼泪螺旋升天。",
  [97]="扁桃体\n·受伤时概率生成阻挡眼泪的跟班。",
  [98]="鼻涕\n·概率发射黏在敌人上的鼻涕。",
  [99]="超级球\n·概率发射弹跳眼泪。",
  [100]="点亮的灯泡\n·主动道具满充能时获得全属性上升。",
  [101]="黯淡的灯泡\n·主动道具零充能时获得全属性上升。",
  [102]="撕碎的牌\n·每层会出现两个隐藏房。",
  [103]="平等！\n·当角色的硬币、炸弹、钥匙的数量相同时，将所有硬币、炸弹、钥匙掉落物变为双倍版本。",
  [104]="许愿骨\n·受伤时概率掉落道具。",
  [105]="便当\n·受伤时概率生成午餐。",
  [106]="丢失的软木塞\n·水迹半径增大。",
  [107]="乌鸦的心\n·优先扣除红心。",
  [108]="核桃\n·受伤时概率掉落掉落物。",
  [109]="胶带\n·跟班不再移动。",
  [110]="银币\n·第四章会出现商店。",
  [111]="染血王冠\n·第四章会出现宝箱房。",
  [112]="充钱玩家\n·宝箱房会出现补货机。",
  [113]="战争之蝗虫\n·每个房间生成一只会爆炸的蝗虫。",
  [114]="瘟疫之蝗虫\n·每个房间生成一只会让敌人中毒的蝗虫。",
  [115]="饥荒之蝗虫\n·每个房间生成一只会让敌人减速的蝗虫。",
  [116]="死亡之蝗虫\n·每个房间生成一只造成大量伤害的蝗虫。",
  [117]="征服之蝗虫\n·每个房间生成数只蝗虫。",
  [118]="蝙蝠翅膀\n·受伤时概率在当前房间中获得飞行。",
  [119]="干细胞\n·进入新的一层时回复红心。",
  [120]="发夹\n·进入首领房时充满主动道具。",
  [121]="木质十字架\n·每层抵挡一次伤害。",
  [122]="黄油！\n·使用主动道具会让主动道具滑落。",
  [123]="银丝羽毛\n·消灭天使会掉落随机道具。",
  [124]="门挡\n·角色经过的最后一扇门会保持开启。",
  [125]="扩展电缆\n·角色与跟班之间会生成具有接触伤害的电弧。",
  [126]="发臭便士\n·捡起硬币时生成一只蓝苍蝇",
  [127]="弯弯宝宝\n·跟班的子弹获得跟踪效果",
  [128]="手指骨\n·受伤时有几率获得骨心"
}

local cardDescriptions = {
  [1]="0-愚者\n·使用后，传送到初始房间。",
  [2]="I-魔法师\n·使用后，在当前房间中，眼泪获得追踪效果。",
  [3]="II-女祭司\n·使用后，对房间中血量最高的敌人（？）造成大量伤害。",
  [4]="III-皇后\n·使用后，在当前房间中，获得伤害上升和移速上升。",
  [5]="IV-皇帝\n·使用后，传送到首领房。",
  [6]="V-教皇\n·使用后，魂心+2。",
  [7]="VI-恋人\n·使用后，红心+2。",
  [8]="VII-战车\n·使用后，短暂无敌且能对敌人造成接触伤害。",
  [9]="VIII-正义\n·使用后，红心+1，硬币+1，炸弹+1，钥匙+1。",
  [10]="IX-隐者\n·使用后，传送到商店。",
  [11]="X-命运之轮\n·使用后，随机生成1个赌博机或预言机。",
  [12]="XI-力量\n·使用后，在当前房间中，角色尺寸上升，心之容器+1，回满红心，伤害上升，移速上升，射程上升。",
  [13]="XII-倒吊人\n·使用后，在当前房间中，角色获得飞行效果。",
  [14]="XIII-死亡\n·使用后，对所有敌人造成中等伤害。",
  [15]="XIV-节制\n·使用后，生成1个献血机。",
  [16]="XV-恶魔\n·使用后，在当前房间中，伤害上升。",
  [17]="XVI-塔\n·使用后，生成6个即爆炸弹。",
  [18]="XVII-星星\n·使用后，传送到宝箱房。",
  [19]="XVIII-月亮\n·使用后，传送到隐藏房。",
  [20]="XIX-太阳\n·使用后，对所有敌人造成大量伤害，显示除超级隐藏房以外所有房间的位置和图标，回复所有红心。",
  [21]="XX-审判\n·使用后，随机生成1个乞丐。",
  [22]="XXI-世界\n·使用后，显示除超级隐藏房以外所有房间的位置和图标。",
  [23]="梅花2\n·使用后，炸弹×2。",
  [24]="方片2\n·使用后，硬币×2。",
  [25]="黑桃2\n·使用后，钥匙×2。",
  [26]="红桃2\n·使用后，红心×2。",
  [27]="梅花A\n·使用后，将房间中的所有掉落物变为炸弹。",
  [28]="方片A\n·使用后，将房间中的所有掉落物变为硬币。",
  [29]="黑桃A\n·使用后，将房间中的所有掉落物变为钥匙。",
  [30]="红桃A\n·使用后，将房间中的所有掉落物变为红心。",
  [31]="鬼牌\n·使用后，传送到恶魔房或天使房。",
  [32]="冰雹\n·使用后，摧毁房间中的所有障碍物。",
  [33]="丰收\n·使用后，复制所有掉落物。",
  [34]="快马\n·使用后，生成一个活板门。",
  [35]="朝夕\n·使用后，魂心+1，清除诅咒。",
  [36]="诸神\n·使用后，显示所有房间的位置和图标。",
  [37]="签筒\n·使用后，重置房间中的所有道具。",
  [38]="桦木\n·使用后，蓝苍蝇+3，蓝蜘蛛+3。",
  [39]="驼鹿\n·使用后，获得一个持续30秒的护盾。",
  [40]="空白符文\n·使用后，随机触发一个符文的效果，有概率掉落1个空白符文。",
  [41]="黑符文\n·使用后，对所有敌人造成中等伤害，将房间中的所有物品变为属性加成或蓝苍蝇/蓝蜘蛛。",
  [42]="混沌卡\n·使用后，丢出混沌卡，消灭碰到的敌人。",
  [43]="信用卡\n·使用后，当前房间中的所有物品免费。",
  [44]="规则卡\n·使用后，显示一条游戏规则。",
  [45]="反人类卡\n·使用后，整个房间充满大便。",
  [46]="自杀之王\n·使用后，角色死亡，掉落10个物品。",
  [47]="脱狱卡\n·使用后，打开所有的门。",
  [48]="？卡\n·使用后，触发主动道具的效果。",
  [49]="骰子碎片\n·使用后，重置当前房间中的所有物品。",
  [50]="紧急联络\n·使用后，随机使2个敌人被定身/消灭。",
  [51]="神圣卡\n·使用后，在当前房间中，抵挡1次受到的伤害。",
  [52]="变硕术\n·使用后，当前房间中角色能够摧毁障碍物，尺寸上升，伤害上升，射程上升。",
  [53]="先祖召唤\n·使用后，掉落3个卡牌。",
  [54]="时代行走\n·使用后，在当前房间中，移速上升，弹速下降，所有敌人减速。"
}

local pillDescriptions = {
  [0]="有毒气体\n·使用后，角色击退周围的敌人，并使它们中毒。",
  [1]="糟糕的旅程\n·使用后，受到一颗心的伤害。如果角色只有半颗心，则改为回满红心。",
  [2]="钢球\n·使用后，魂心+2。",
  [3]="炸弹是钥匙\n·使用后，角色的炸弹的数量和钥匙的数量互换。",
  [4]="爆炸性腹泻\n·使用后，生成5个炸弹。",
  [5]="回满血量\n·使用后，回复所有红心。",
  [6]="血量下降\n·使用后，心之容器-1。",
  [7]="血量上升\n·使用后，心之容器+1。",
  [8]="我找到药丸了\n·使用后，改变角色外貌。（无实际效果）",
  [9]="青春期\n·使用后，改变角色外貌。（无实际效果）",
  [10]="漂亮的苍蝇\n·使用后，获得一个苍蝇环绕物。",
  [11]="射程下降\n·使用后，射程下降。",
  [12]="射程上升\n·使用后，射程上升。",
  [13]="移速下降\n·使用后，移速下降。",
  [14]="移速上升\n·使用后，移速上升。",
  [15]="射速下降\n·使用后，射击延迟上升。",
  [16]="射速上升\n·使用后，射击延迟下降。",
  [17]="幸运下降\n·使用后，幸运下降。",
  [18]="幸运上升\n·使用后，幸运上升。",
  [19]="传送药丸\n·使用后，随机传送到一个房间。",
  [20]="48小时能量！\n·使用后，充满充能，电池+1~2。",
  [21]="呕血\n·使用后，红心变为一颗，红心+1~4。",
  [22]="瘫痪\n·使用后，角色暂时无法行动。",
  [23]="我能看见永远！\n·使用后，打开隐藏房和超级隐藏房的门。",
  [24]="信息素\n·使用后，魅惑所有敌人。",
  [25]="失忆症\n·使用后，获得迷失诅咒。",
  [26]="柠檬派对\n·使用后，生成一摊黄色水迹，对踩在上面的敌人造成大量伤害。",
  [27]="你是巫师吗？\n·使用后，30秒内角色会斜向发射眼泪。",
  [28]="止痛药！\n·使用后，在当前房间中，伤害变为半颗心。",
  [29]="上瘾！\n·使用后，在当前房间中，伤害变为一颗心。",
  [30]="放-松\n·使用后，生成一堆大便。",
  [31]="？？？\n·使用后，本层获得迷宫诅咒。",
  [32]="变大药丸\n·使用后，角色变大。",
  [33]="变小药丸\n·使用后，角色变小。",
  [34]="感染！\n·使用后，摧毁所有大便并生成等量的蓝蜘蛛。",
  [35]="感染？\n·使用后，生成和等同于敌人数量的蓝蜘蛛。",
  [36]="能量药丸！\n·使用后，变身吃豆人，吃掉敌人会回复红心。",
  [37]="复古视野\n·使用后，屏幕会打上马赛克，几秒后消失。",
  [38]="好朋友一辈子！\n·使用后，生成3只蓝苍蝇。",
  [39]="泻药\n·使用后，生成一大滩棕色水迹，角色踩在上面会打滑。",
  [40]="哪里不对…\n·使用后，在角色的脚底产生一大滩黑色的水迹。",
  [41]="好困…\n·使用后，使房间中的所有敌人减速。",
  [42]="我很兴奋！\n·使用后，使房间内的所有敌人加速。30秒后以及60秒后再次触发该效果。",
  [43]="咕噜！\n·使用后，角色携带的所有饰品被吞噬，角色永久获得这些饰品的效果。",
  [44]="吼！\n·使用后，向前抛射一颗爆炸眼泪。",
  [45]="就像走在阳光上！\n·使用后，短时间无敌。",
  [46]="Vurp!\n·使用后，掉落一个你上一次使用的药丸。"
}

--Transformations: 0=none, 1=guppy,2=mushroom,3=lord of the flies, 4=conjoined,5= junkie(Spun),6=mom,7=poopboy(oh crap),8=bob,9=leviathan,10=Seraphim,11=super bum,12=bookworm,13=Spider boy,
-- 0=无, 1=猫套, 2=蘑菇套, 3=苍蝇套, 4=宝宝套, 5=针筒套, 6=妈妈套, 7=大便套, 8=鲍勃套, 9=恶魔套, 10=天使套, 11=乞丐套, 12=书呆子, 13=蜘蛛套
local transformations = {
  [0]={"",""},
  [1]={"Guppy","猫套"},
  [2]={"Fun Guy","蘑菇套"},
  [3]={"Lord of the Flies","苍蝇套"},
  [4]={"Conjoined","宝宝套"},
  [5]={"Spun","针筒套"},
  [6]={"Mom","妈妈套"},
  [7]={"Oh crap","大便套"},
  [8]={"Bob","鲍勃套"},
  [9]={"Leviathan","恶魔套"},
  [10]={"Seraphim","天使套"},
  [11]={"Super Bum","乞丐套"},
  [12]={"Bookworm","书呆子"},
  [13]={"Spider Baby","蜘蛛套"}
}

--[[
  Init variables for other mods to hand over Descriptions
  if they were not yet inited by another mod.
--]]
if not __eidItemDescriptions then
  __eidItemDescriptions = {};
end
if not __eidTrinketDescriptions then
  __eidTrinketDescriptions = {};
end
if not __eidCardDescriptions then
  __eidCardDescriptions = {};
end
if not __eidPillDescriptions then
  __eidPillDescriptions = {};
end
if not __eidItemTransformations then
  __eidItemTransformations = {};
end

function getModDescription(list, id)
  return (list) and (list[id])
end

function table.load( sfile )
  local ftables,err = loadfile( sfile )
  if err then return _,err end
  local tables = ftables()
  for idx = 1,#tables do
    local tolinki = {}
    for i,v in pairs( tables[idx] ) do
      if type( v ) == "table" then
        tables[idx][i] = tables[v[1]]
      end
      if type( i ) == "table" and tables[i[1]] then
        table.insert( tolinki,{ i,tables[i[1]] } )
      end
    end
    for _,v in ipairs( tolinki ) do
      tables[idx][v[2]],tables[idx][v[1]] =  tables[idx][v[1]],nil
    end
  end
  return tables[1]
end 
function SubStringUTF8(str, startIndex, endIndex)
  if startIndex < 0 then
    startIndex = SubStringGetTotalIndex(str) + startIndex + 1;
  end

  if endIndex ~= nil and endIndex < 0 then
    endIndex = SubStringGetTotalIndex(str) + endIndex + 1;
  end

  if endIndex == nil then 
    return string.sub(str, SubStringGetTrueIndex(str, startIndex));
  else
    return string.sub(str, SubStringGetTrueIndex(str, startIndex), SubStringGetTrueIndex(str, endIndex + 1) - 1);
  end
end

function SubStringGetTotalIndex(str)
  local curIndex = 0;
  local i = 1;
  local lastCount = 1;
  repeat 
    lastCount = SubStringGetByteCount(str, i)
    i = i + lastCount;
    curIndex = curIndex + 1;
  until(lastCount == 0);
  return curIndex - 1;
end

function SubStringGetTrueIndex(str, index)
  local curIndex = 0;
  local i = 1;
  local lastCount = 1;
  repeat 
    lastCount = SubStringGetByteCount(str, i)
    i = i + lastCount;
    curIndex = curIndex + 1;
  until(curIndex >= index);
  return i - lastCount;
end

function SubStringGetByteCount(str, index)
  local curByte = string.byte(str, index)
  local byteCount = 1;
  if curByte == nil then
    byteCount = 0
  elseif curByte > 0 and curByte <= 127 then
    byteCount = 1
  elseif curByte>=192 and curByte<=223 then
    byteCount = 2
  elseif curByte>=224 and curByte<=239 then
    byteCount = 3
  elseif curByte>=240 and curByte<=247 then
    byteCount = 4
  end
  return byteCount;
end

function FontPreLoad()
  local i=0;
  if config["FontLoadMode"]==1 then
    for i=1,#defaultpages[fontsizeReal] do
      if spritetable[defaultpages[fontsizeReal][i]] == nil then
        local tmpsprite = Sprite()
        tmpsprite:Load(fontpath..fontsizeReal.."/font_"..string.rep("0",3-string.len(defaultpages[fontsizeReal][i]))..defaultpages[fontsizeReal][i]..".anm2", true)
        spritetable[defaultpages[fontsizeReal][i]] = tmpsprite
        tmpsprite = nil
      end
    end
  elseif config["FontLoadMode"]==2 then
    for i=0,fontmap["pages"]-1 do
      if spritetable[i] == nil then
        local tmpsprite = Sprite()
        tmpsprite:Load(fontpath..fontsizeReal.."/font_"..string.rep("0",3-string.len(i))..i..".anm2", true)
        spritetable[i] = tmpsprite
        tmpsprite = nil
      end
    end
  end
end

function DrawString(str,x,y)
  if not(str) then 
    str="传入字符串为空！"
  end
  local word = ""
  local lastid = 0
  local strlen = SubStringGetTotalIndex(str)
  local DrawPositionX = x
  local DrawPositionY = y
  if not(DrawPositionX) then
    DrawPositionX=config["XPosition"]
  end
  if not(DrawPositionY) then
    DrawPositionY=config["YPosition"]
  end
  for i = 1,strlen do
    word = SubStringUTF8(str, i, i)
    if (word ~= "\n") then
      if not(fontmap[word]) then
        word = "?"
      end
      if (word ~= "，" and word ~= "。" and DrawPositionX + fontmap[word].xadvance * fontScaleReal + 2 > config["FontMaxLength"]) then
        DrawPositionX = config["XPosition"]
        DrawPositionY = DrawPositionY + config["FontLineHeigh"] * fontScaleReal
        lastid = 0
      end
      DrawFont(fontmap[word].id,fontmap[word].page,DrawPositionX + (fontmap[word].xoffset + GetKerning(fontmap[word].id,lastid)) * fontScaleReal,DrawPositionY + fontmap[word].yoffset * fontScaleReal)
      DrawPositionX = DrawPositionX + fontmap[word].xadvance * fontScaleReal + 2
      lastid = fontmap[word].id
    else
      DrawPositionX = config["XPosition"]
      DrawPositionY = DrawPositionY + config["FontLineHeigh"] * fontScaleReal
      lastid = 0
    end
  end
end

function DrawFont(id,pageid,x,y)
  if spritetable[pageid] == nil then
    local tmpsprite = Sprite()
    tmpsprite:Load(fontpath..fontsizeReal.."/font_"..string.rep("0",3-string.len(pageid))..pageid..".anm2", true)
    spritetable[pageid] = tmpsprite
    tmpsprite = nil
  end
  spritetable[pageid]:Play(id)
  spritetable[pageid].Scale = Vector(fontScaleReal,fontScaleReal)
  spritetable[pageid].Color = Color( 1, 1, 1, config["FontTransparency"] , 0, 0, 0 )
  spritetable[pageid]:Update()
  spritetable[pageid]:Render(Vector(x,y), Vector(0,0), Vector(0,0))
end

function GetKerning(id,lastid)
  if lastid ~= 0 then
    for i = 1,#kernings do
      if (kernings[i].second == id and kernings[i].first == lastid) then
        return kernings[i].amount
      end
    end
  end
  return 0
end

local function printTransformation(S)
  local str=transformations[tonumber(S)]
  if not(str) then
    str = "Custom"
  end
  return str
end

local function printDescription(desc)
  local temp = config["YPosition"]
  if not(desc[2]=="0" or desc[2]==""or desc[2]==nil ) then
    if config["TransformationText"]=="true" then
      if config["TransformationIcons"]=="true" and not(printTransformation(desc[2])=="Custom") then
        DrawString(printTransformation(desc[2])[2])
      elseif not(transformations[desc[2]]) then --Custom transformationname
        DrawString(desc[2])
      else
        DrawString(printTransformation(desc[2])[2])
      end
    end
    if config["TransformationIcons"]=="true" and not(printTransformation(desc[2])=="Custom") and printTransformation(desc[2])[1]~="" then
      local sprite = Sprite()
      sprite:Load("gfx/icons.anm2", true)
      sprite:Play(printTransformation(desc[2])[1])
      sprite.Scale = Vector(config["Scale"],config["Scale"])
      sprite.Color = Color( 1, 1, 1, config["Transparency"] , 0, 0, 0 )
      sprite:Update()
      sprite:Render(Vector(config["XPosition"]-13*config["Scale"],temp+10*config["Scale"]), Vector(0,0), Vector(0,0))
    end
    temp = temp+config["FontLineHeigh"]*fontScaleReal
  end
  DrawString(desc[1],config["XPosition"],temp)
end

function HasCurseBlind()
  local num = Game():GetLevel():GetCurses()
  local t={}
  while num>0 do
    rest=num%2
    t[#t+1]=rest
    num=(num-rest)/2
  end
  return #t>6 and t[7]==1 
end

local function onRender(t)
  if HasCurseBlind() and config["EnableOnCurse"]=="false" then
    return
  end
  local player = Isaac.GetPlayer(0)
  local closest = nil;
  local dist = 10000;
  for i, coin in ipairs(Isaac.GetRoomEntities()) do
    if coin.Type == EntityType.ENTITY_PICKUP and (coin.Variant == PickupVariant.PICKUP_COLLECTIBLE or coin.Variant == PickupVariant.PICKUP_TRINKET or coin.Variant == PickupVariant.PICKUP_TAROTCARD or coin.Variant == PickupVariant.PICKUP_PILL) and coin.SubType>0  then
      local diff = coin.Position:__sub(player.Position);
      if diff:Length() < dist then
        closest = coin;
        dist = diff:Length();
      end  
    end
  end 

  if dist/40>tonumber(config["MaxDistance"]) then
    return
  end
  --TODO: Load Mode 3
  if closest.Type == EntityType.ENTITY_PICKUP then
    if closest.Variant == PickupVariant.PICKUP_TRINKET then
      --Handle Trinkets
      if closest.SubType < 129 then
        if not(trinketdescriptions[closest.SubType]) then
          DrawString("— 未知饰品："..closest.SubType)
        else
          DrawString(trinketdescriptions[closest.SubType])
        end
      elseif getModDescription(__eidTrinketDescriptions,closest.SubType) then
        DrawString(getModDescription(__eidTrinketDescriptions,closest.SubType))
      else
        DrawString(config["ErrorMessage"])
      end
      --Handle Collectibles
    elseif closest.Variant == PickupVariant.PICKUP_COLLECTIBLE then
      if closest.SubType < 553 then
        if getModDescription(__eidItemTransformations,closest.SubType) then
          printDescription({descriptarray[closest.SubType][2],getModDescription(__eidItemTransformations,closest.SubType)})
        elseif not(descriptarray[closest.SubType]) then
          DrawString("— 未知道具："..closest.SubType)
        else
          printDescription(descriptarray[closest.SubType])
        end
      elseif getModDescription(__eidItemDescriptions,closest.SubType) then
        local tranformation = "0"
        if  getModDescription(__eidItemTransformations,closest.SubType) then
          tranformation = getModDescription(__eidItemTransformations,closest.SubType)
        end
        printDescription({getModDescription(__eidItemDescriptions,closest.SubType),tranformation})
      else
        DrawString(config["ErrorMessage"])
      end
      --Handle Cards & Runes
    elseif closest.Variant == PickupVariant.PICKUP_TAROTCARD then
      if not(config["DisplayCardInfo"]=="false") and not(closest:ToPickup():IsShopItem() and config["DisplayCardInfoShop"]=="false") then
        if closest.SubType < 55 then 
          if not(cardDescriptions[closest.SubType]) then
            DrawString("— 未知卡牌："..closest.SubType)
          else
            DrawString(cardDescriptions[closest.SubType])
            local sprite = Sprite()
            sprite:Load("gfx/cardfronts.anm2", true)
            sprite.Scale = Vector(config["Scale"],config["Scale"])
            sprite.Color = Color( 1, 1, 1, config["Transparency"] , 0, 0, 0 )
            sprite:Play(tostring(closest.SubType))
            sprite:Update()
            sprite:Render(Vector(config["XPosition"] - 10*config["Scale"],config["YPosition"]+12*config["Scale"]), Vector(0,0), Vector(0,0))
          end
        elseif getModDescription(__eidCardDescriptions,closest.SubType) then
          DrawString(getModDescription(__eidCardDescriptions,closest.SubType))
          --TODO: add sprite
        else
          DrawString(config["ErrorMessage"])
        end
      end
      --Handle Pills
    elseif closest.Variant == PickupVariant.PICKUP_PILL then
      if config["DisplayPillInfo"] and not(closest:ToPickup():IsShopItem() and config["DisplayPillInfoShop"]=="false") then
        pillColor = closest.SubType
        pool = Game():GetItemPool()
        pillEffect = pool:GetPillEffect(pillColor)
        identified = pool:
        IsPillIdentified(pillColor)

        if (identified or config["ShowUnidentifiedPillDescriptions"]== "true") then
          if (pillEffect < 47) or getModDescription(__eidPillDescriptions,pillEffect) then
            if pillEffect < 47 then 
              if not(pillDescriptions[pillEffect]) then
                DrawString("— 未知胶囊："..pillEffect)
              else
                DrawString(pillDescriptions[pillEffect])
              end
            else
              DrawString(getModDescription(__eidPillDescriptions,pillEffect))
            end
            local pillsprite = closest:GetSprite()
            pillsprite.Scale = Vector(config["Scale"],config["Scale"])
            pillsprite.Color = Color( 1, 1, 1, config["Transparency"] , 0, 0, 0 )
            pillsprite:Update()
            pillsprite:Render(Vector(config["XPosition"]-12*config["Scale"],config["YPosition"]+16*config["Scale"]), Vector(0,0), Vector(0,0))
            pillsprite.Scale = Vector(1,1)
          else
            DrawString(config["ErrorMessage"])
          end
        else
          DrawString(config["UnidentifiedPillMessage"])
        end
      end
    end
  end
end
local function onExit()
  for key, value in pairs(spritetable) do
    spritetable[key]:Reset ()
    spritetable[key] = nil
  end
  return true
end
FontPreLoad()
EID:AddCallback(ModCallbacks.MC_POST_RENDER, onRender)
EID:AddCallback(ModCallbacks.MC_PRE_GAME_EXIT, onExit)